Repository: 84000/data-translation-memory
Catalog: toh65-v3.tmx
Source language: bo
Languages: en

source: བཞི་པོ་དེ་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་དོན་ཟབ་མོ་ལ་སྦྱོར་བ་ཡིན་ནོ། །
en: These four are bodhisattvas’ engagement with profound meaning.

source: བཟང་པོ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་དང་ལྡན་ན་སྨོན་ལམ་འགྲུབ་པར་འགྱུར་ཏེ།
en: “Bhadra, when bodhisattvas have four qualities, they will realize their aspirations.

source: ཚུལ་ཁྲིམས་དང་བསླབ་པ་ཡོངས་སུ་དག་པ་དང་། ལས་ཀྱི་སྒྲིབ་པ་རྣམ་པར་སྦྱོང་བ་དང་། གཡོ་སྒྱུ་མེད་པ་དང་། དགེ་བའི་རྩ་བ་བསྐྱེད་པ་ལ་སེམས་དབང་བྱེད་པ་སྟེ།
en: Observing perfect discipline and training, purifying karmic obscurations, being without deceit, and mastering their minds to generate roots of virtue.

source: བཞི་པོ་དེ་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྨོན་ལམ་འགྲུབ་པར་འགྱུར་བའོ། །
en: With these four, the aspirations of bodhisattvas will be realized.

source: བཟང་པོ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་དང་ལྡན་ན་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཐམས་ཅད་ཀྱིས་འཕགས་ཤིང་ཕྱིར་མི་ལྡོག་པའི་ཆོས་ཅན་དུ་འགྱུར་ཏེ།
en: “Bhadra, when bodhisattvas have four qualities, they will be exalted and will gain the quality of irreversibility through all the perfections.

source: ཐབས་མཁས་པ་དང་ལྡན་པས་ཕ་རོལ་ཏུ་ཕྱིན་པ་གཅིག་གི་ནང་དུ་ཕ་རོལ་ཏུ་ཕྱིན་པ་གཞན་ཐམས་ཅད་ཀྱང་སྡུད་པར་བྱེད་པ་དང་། ཐབས་མཁས་པ་དང་ལྡན་པས་སེམས་ཅན་གཅིག་གི་རང་བཞིན་རྟོགས་པས་དེ་ལས་གཞན་པའི་སེམས་ཅན་ཐམས་ཅད་ཀྱང་ཤེས་པ་དང་། ཐབས་མཁས་པ་དང་ལྡན་པས་ཆོས་རྣམ་པར་དག་པ་གཅིག་གི་ཚུལ་རྟོགས་པས་ཆོས་གཞན་དག་གི་རྣམ་པར་དག་པ་ཡང་ཤེས་པ་དང་། ཆོས་ཉིད་ཡིན་པས་སངས་རྒྱས་ཐམས་ཅད་སངས་རྒྱས་གཅིག་ཏུ་མོས་པ་སྟེ།
en: By being skilled in means, subsuming all the perfections within a single perfection; by being skilled in means, knowing all beings by realizing the nature of a single being; by being skilled in means, knowing the purity of other phenomena by realizing the purity of a single phenomenon; and, since all is the true nature, being devoted to all buddhas through a single buddha.

source: བཟང་པོ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་པོ་དེ་དག་དང་ལྡན་ན་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཐམས་ཅད་ཀྱིས་འཕགས་ཤིང་ཕྱིར་མི་ལྡོག་པའི་ཆོས་ཅན་དུ་འགྱུར་རོ། །
en: Bhadra, when bodhisattvas have these four qualities, they will be exalted and will gain the quality of irreversibility through all the perfections.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཞི་པ་སྒྲུབ་པ་འདི་བཤད་པ་ན་སྒྱུ་མ་མཁན་བཟང་པོ་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་ནས་ཚིམ་ཞིང་མགུ་ལ་ཡི་རངས་ཏེ།
en: When the Blessed one had explained these sets of four accomplishments, Bhadra the illusionist attained the acceptance that phenomena are unborn.

source: རབ་ཏུ་དགའ་ཞིང་དགའ་བ་དང་། ཡིད་བདེ་བར་གྱུར་ནས་དགའ་བ་དང་།
en: He was utterly delighted and, rejoicing, became overjoyed and blissful.

source: མཆོག་ཏུ་དགའ་བ་དེ་ཉིད་ཀྱིས་ཤིང་ཏ་ལ་བདུན་སྲིད་ཙམ་གྱི་སྟེང་གི་ནམ་མཁའ་ལ་འཕགས་སོ། །
en: He was so extremely happy that he rose into the sky to the height of seven palm trees.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་ཚེ་འཛུམ་པ་མཛད་དོ། །
en: Then, the Blessed One smiled.

source: འཛུམ་པ་མཛད་པའི་ཞལ་གྱི་སྒོ་ནས་འོད་ཟེར་གྲངས་མེད་དཔག་ཏུ་མེད་པ་བཀྱེ་བས་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་འོད་ཟེར་དེས་ཁྱབ་པར་བྱས་ནས་སླར་ཡང་བཅོམ་ལྡན་འདས་ཀྱི་དབུའི་གཙུག་ཏུ་ནུབ་བོ། །
en: And from his smile radiated countless incalculable rays of light that, after suffusing all the buddhafields with light, returned once again and descended into the crown of the Blessed One’s head.

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་སྟན་ལས་ལངས་ཏེ་ཆོས་གོས་ཕྲག་པ་གཅིག་ཏུ་བགོས་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ།
en: Venerable Ānanda then rose from his seat.

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ནི་རྒྱུ་མ་མཆིས་པ་དང་། རྐྱེན་མ་མཆིས་པར་འཛུམ་པ་མི་མཛད་ན་འཛུམ་པ་མཛད་པའི་རྒྱུ་གང་ལགས།
en: Folding his Dharma robe over one shoulder, he placed his right knee on the ground, bowed in the direction of the Blessed One with his palms pressed together, and said, “As the honorable Blessed Tathāgata does not smile without a reason or condition, what was the reason for your smile?

source: རྐྱེན་གང་ལགས།
en: What was the condition?”

source: དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་ཀྱང་གསོལ་ཏོ། །ཡེ་ཤེས་འབྱུང་གནས་གཟི་བརྗིད་གཞལ་ཡས་ཤེས་རབ་གྲགས། །འཇིག་རྟེན་གསུམ་དུ་ཡོན་ཏན་ཕ་རོལ་ཕྱིན་བརྙེས་གྲགས། །རྒྱལ་བ་རང་བྱུང་གང་གི་སླད་དུ་འཛུམ་བསྟན་པ། །
en: Then he spoke these verses: “O source of wisdom renowned for your measureless splendor and insight, Renowned in the three worlds as having perfected the qualities, Self-arisen Victor, why have you shown us this smile?

source: མི་ཡི་དབང་པོས་དེ་ནི་བདག་ལ་བཀའ་སྩལ་གསོལ། །
en: May the lord among humans please answer me that.

source: ཕྱོགས་རྣམས་ན་ནི་འགྲོ་བ་སེམས་ཅན་ཇི་སྙེད་གནས། །དེ་དག་ཀུན་གྱི་སེམས་ཀྱི་སྤྱོད་པ་རྣམས་དང་ནི། །དམན་དང་མཆོག་དང་ཐ་མ་བར་མ་རྒྱུ་ལྡན་མཁྱེན། །
en: “However many migrating beings there are in all directions, You know the mental activities of them all— Those of low and high, and finally of middling capacity.

source: ཇི་སླད་འཛུམ་པ་མཛད་པ་བདག་ལ་བསྟན་དུ་གསོལ། །
en: For what purpose did you show me that smile?

source: ལྷ་དང་དེ་བཞིན་ཞུགས་འབར་སྒྲ་ནི་གང་ལགས་དང་། །མི་འམ་ཅི་དང་མི་དང་བརྒྱ་བྱིན་ལྷ་མིན་དང་། །མཁའ་ལྡིང་ལྟོ་འཕྱེ་ཚངས་པའི་སྒྲ་དང་སྒྲ་གཞན་རྣམས། །སངས་རྒྱས་རྡུལ་བྲལ་གསུང་སྒྲའི་ཆར་ཡང་ག་ལ་སྤྱོད། །
en: “The voices of the gods and those who likewise blaze with fire, The voices of kinnaras, humans, Śakra, asuras, Garuḍas, uragas, and Brahmā, and all other sounds— How can they compare to even a portion of the Buddha’s immaculate voice?

source: འོད་བཟང་ཉི་མའི་འོད་དང་ནོར་བུའི་འོད་རྣམས་དང་། །བརྒྱ་བྱིན་འོད་དང་ཚངས་པའི་འོད་རྣམས་ཇི་སྙེད་པ། །ཇི་ལྟར་སངས་རྒྱས་འོད་ཀྱིས་ཁྱབ་པར་གདའ་བ་ལྟར། །འོད་རྣམས་དེ་དག་ཐམས་ཅད་རྣམ་པར་གསལ་མ་ལགས། །
en: “The shining of the brilliant sun, the glittering of jewels, The light of Śakra and Brahmā—whatever light there is to be found— Compared to the Buddha’s suffusing radiance, Those lights do not shine at all.

source: སངས་རྒྱས་ཞིང་དེ་ཟབ་མོའི་ཆོས་ནི་རྗེས་སུ་ཐོབ། །
en: “In this buddhafield you obtained the profound Dharma.

source: སྟོང་པ་བདག་མེད་སེམས་ཅན་གང་ཟག་མེད་མཁྱེན་ནས། །ཡོད་དང་མེད་པའི་མཐའ་གཉིས་རྣམ་པར་སྤངས་ནས་སུ། །དུས་གསུམ་ཆུ་ཟླ་འདྲ་བར་རབ་ཏུ་མཁྱེན་པ་པོ། །
en: Knowing emptiness, selflessness, and that for beings no individual person exists, You have fully abandoned the two extremes of existence and nonexistence, And you know well that the three times are like the moon’s reflection on water.

source: དེང་འདིར་སུ་ཞིག་ཐེག་པའི་མཆོག་ལ་སེམས་བཏུད་དེ། །
en: “Who here and now has a mind inclined toward the supreme vehicle?

source: སུ་ཞིག་སངས་རྒྱས་རིགས་དང་ཆོས་ཀྱི་རིགས་ལ་གནས། །
en: Who belongs to the Buddha’s lineage and the lineage of the Dharma?

source: སུ་ཞིག་དཀོན་མཆོག་གསུམ་པོ་རྒྱ་ཆེར་སྐྱེད་པར་བགྱིད། །
en: Who propagates the flourishing of the Three Jewels?

source: གང་གི་ཆེད་དུ་འཛུམ་པ་མཛད་པ་ལེགས་པར་གསུངས། །
en: Please explain well the reason for your smile!

source: གལ་ཏེ་རྒྱལ་བ་ཉན་ཐོས་རྣམས་ལ་དོན་ལྡན་གསུང་། །དེ་ཚེ་བདེ་གཤེགས་འཛུམ་པ་ཞབས་ཀྱི་པུས་མོར་ནུབ། །གལ་ཏེ་རྐྱེན་གྱི་ཐེག་པ་གསུང་ན་ཕྲག་པར་ནུབ། །གལ་ཏེ་སངས་རྒྱས་ཐེག་གསུང་དེ་ཚེ་སྤྱི་བོར་ནུབ། །
en: “If the meaning of the Victorious One’s teaching is intended for śrāvakas, Then the rays of light from the Sugata’s smile descend back into his knees; If taught for the Pratyekabuddha Vehicle, they descend into his shoulders; And if taught for the Buddha Vehicle, they descend into the crown of his head.

source: ཇི་ལྟར་ཁྱོད་ཀྱིས་འོད་ཟེར་འབུམ་སྙེད་རབ་བཏང་བ། །བདེ་བར་གཤེགས་ཀྱི་གཙུག་ཏུ་ནུབ་པར་གྱུར་ལགས་ན། །ཕན་མཛད་ལྷ་ཡི་ལྷ་སྟེ་ཕན་པ་མཛད་པ་པོ། །འདི་ནི་སངས་རྒྱས་ཐེག་པར་ལུང་སྟོན་དོགས་མ་མཆིས། །
en: “Since the hundred thousand rays of light emitted by you Descended into the crown of the Well-Gone One, There is no doubt, O beneficent god of gods, O benefactor, That this is a prophecy for the Buddha Vehicle.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་བ། ཀུན་དགའ་བོ་ཁྱོད་ཀྱིས་རིགས་ཀྱི་བུ་བཟང་པོ་མཐོང་ངམ།
en: Then the Blessed One asked Venerable Ānanda, “Ānanda, do you see Bhadra, this son of noble family?”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་མཐོང་ལགས་སོ། །
en: “Blessed One, I see him,” replied Ānanda.

source: བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་རིགས་ཀྱི་བུ་བཟང་པོ་འདི་ནི་བསྐལ་པ་དགུ་ཁྲི་ཉིས་སྟོང་ན་བསྐལ་པ་ལེགས་པར་སྤྲུལ་པ་ལ་འཇིག་རྟེན་གྱི་ཁམས་བཀོད་པ་ཆེན་པོར་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམ་པར་འཕྲུལ་པའི་རྒྱལ་པོ་ཞེས་བྱ་བར་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་ཏེ།
en: “Ānanda, ninety-two thousand eons from now in the eon Excellent Manifestation, in the world system Great Array, Bhadra, this son of noble family, will appear in the world as a tathāgata, arhat, complete and perfect buddha named Vikurvāṇarāja.

source: ཀུན་དགའ་བོ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམ་པར་འཕྲུལ་པའི་རྒྱལ་པོ་དེའི་འཇིག་རྟེན་གྱི་ཁམས་བཀོད་པ་ཆེན་པོ་ཞེས་བྱ་བ་དེ་ནི་འབྱོར་པར་འགྱུར། རྒྱས་པ་དང་། བདེ་བ་དང་། ལོ་ལེགས་པ་དང་། ཉམས་དགའ་བ་དང་། མི་དང་སྐྱེ་བོ་མང་པོས་གང་བར་འགྱུར་ཞིང་ལག་མཐིལ་ལྟར་མཉམ་པ་དང་།
en: “Ānanda, the tathāgata, arhat, complete and perfect Buddha Vikurvāṇarāja’s world system called Great Array will be rich, vast, happy, abundant with good harvests, pleasant, and filled with many people and beings.

source: ཀ་ཙ་ལིན་དི་ལྟར་རེག་ན་འཇམ་པ་དང་། མེ་ཏོག་གི་ཤིང་ལྗོན་པས་བརྒྱན་པ་དང་། རོལ་མོ་སྣ་ཚོགས་སྒྲོགས་པ་དང་། སྤོས་སྣ་ཚོགས་ཀྱིས་བདུགས་པ་དང་། རྟག་ཏུ་རྒྱུན་མི་འཆད་པར་གདུགས་དང་།
en: It will be flat and even like the palm of the hand, soft to the touch like kācilindika cloth, adorned with flowering trees, resounding with the music of various instruments, and made fragrant with various kinds of incense; it will continually, without cease, be filled with raised parasols, victory banners, and flags.

source: རྒྱལ་མཚན་དང་། བ་དན་བསྒྲེང་བར་འགྱུར་རོ། །ཀུན་དགའ་བོ་བཟའ་བ་དང་། བཏུང་བ་ནི་དཔེར་ན་སུམ་ཅུ་རྩ་གསུམ་པའི་ལྷ་རྣམས་ཀྱི་ལོངས་སྤྱོད་ལྟར་བསམས་པ་ཙམ་གྱིས་འགྲུབ་སྟེ།
en: “Ānanda, just as the gods of the Heaven of the Thirty-Three enjoy food and drinks merely by thinking of them, so will the people there enjoy and savor such enjoyments.

source: མི་དེ་དག་གིས་ཉེ་བར་སྤྱད་པ་དང་། ཡོངས་སུ་སྤྱད་པ་ནི་དེ་ལྟ་བུར་འགྱུར་རོ། །ཀུན་དགའ་བོ་དེའི་ཚེ་འཇིག་རྟེན་གྱི་ཁམས་བཀོད་པ་ཆེན་པོ་དེ་རྟག་ཏུ་བཀོད་པ་ཐམས་ཅད་ཉེ་བར་སྟོན་པར་བྱེད་དེ། དེས་ན་འཇིག་རྟེན་གྱི་ཁམས་དེ་བཀོད་པ་ཆེན་པོ་ཞེས་བྱའོ། །
en: “Ānanda, at that time, the world system Great Array will constantly manifest all this array, and thus it will be called the world system Great Array.

source: ཀུན་དགའ་བོ་སངས་རྒྱས་ཀྱི་ཞིང་དེར་སེམས་ཅན་གང་དག་སྐྱེས་པ་དེ་དག་ཐམས་ཅད་ཀྱང་རྒྱ་ཆེན་པོ་ལ་མོས་པ། ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པ་ཤ་སྟག་ཏུ་འགྱུར་རོ། །
en: “Ānanda, all beings born in that buddhafield will be inclined toward greatness, and they will enter properly into the Great Vehicle (Mahāyāna) and nothing else.

source: ཀུན་དགའ་བོ་དེ་བཞིན་གཤེགས་པ་རྣམ་པར་འཕྲུལ་པའི་རྒྱལ་པོའི་ཚེའི་ཚད་ནི་ལོ་ཁྲིར་འགྱུར་རོ། །ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས་ཀྱང་དམ་པའི་ཆོས་ལོ་བྱེ་བར་གནས་པར་འགྱུར་རོ། །
en: “Ānanda, the Tathāgata Vikurvāṇarāja will live for ten thousand years, and after his final nirvāṇa, his holy Dharma will remain for ten million years.

source: ཀུན་དགའ་བོ་གང་གི་ཚེ་དེ་བཞིན་གཤེགས་པ་རྣམ་པར་འཕྲུལ་པའི་རྒྱལ་པོ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་དེའི་ཚེ་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སྒྲ་རྣམ་པར་གྲགས་པ་འདི་ངའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀུན་གྱི་ཁྱབ་བདག་ཅེས་བྱ་བར་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་རོ་ཞེས་བྱང་ཆུབ་སེམས་དཔའ་སྒྲ་རྣམ་པར་གྲགས་པ་ལུང་བསྟན་ནས་ཡོངས་སུ་མྱ་ངན་ལས་འདའོ། །
en: “Ānanda, at that time when the Tathāgata Vikurvāṇarāja is about to pass into his final nirvāṇa, he will give the bodhisattva Resounding Voice a prophecy: ‘After me, the tathāgata, arhat, complete and perfect buddha known as All-Pervasive Lord will appear in the world.’ Having given the prophecy to bodhisattva Resounding Voice, he will pass into final nirvāṇa.”

source: དེ་ནས་རིགས་ཀྱི་བུ་བཟང་པོ་བར་སྣང་དེ་ལས་བབས་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་དེང་སླན་ཆད་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བྱེ་བ་འབུམ་ཕྲག་དུ་མ་དང་། ཆོས་དང་། དགེ་སློང་གི་དགེ་འདུན་ལ་སྐྱབས་སུ་མཆིའོ། །
en: Then Bhadra the son of noble family descended from the air and, bowing his head to the feet of the Blessed One, said these words to him: “Blessed One, henceforth I take refuge in the many trillions of tathāgata, arhat, complete and perfect buddhas and in the Dharma and the Saṅgha of monks.

source: དེ་བཞིན་གཤེགས་པ་དེ་བཞིན་ཉིད་གང་གིས་དེ་བཞིན་ཉིད་ལས་སླར་མ་ལོག་པའི་དེ་བཞིན་གཤེགས་པའི་དེ་བཞིན་ཉིད་དང་། དབྱེར་མ་མཆིས་པའི་དེ་བཞིན་ཉིད་དང་། མ་ཚང་བ་མ་མཆིས་པའི་དེ་བཞིན་ཉིད་དང་། རྣམ་པར་མི་རྟོག་པའི་དེ་བཞིན་ཉིད་དང་། སྐྱེ་བ་མ་མཆིས་པའི་དེ་བཞིན་ཉིད་དང་། མངོན་པར་འདུ་བགྱི་བ་མ་མཆིས་པའི་དེ་བཞིན་ཉིད་ཀྱིས་དེ་བཞིན་གཤེགས་པ་དེ་བཞིན་ཉིད་གསུང་བ་བཞིན་དུ་བདག་ཀྱང་དེ་སྐད་མཆིའོ། །
en: And I will proclaim the suchness of the Tathāgata just as the Tathāgata teaches it by means of the suchness of the Tathāgata, which does not deviate from suchness, the suchness that is indivisible, the suchness free of any imperfection, the nonconceptual suchness, the unborn suchness, the uncompounded suchness.”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་རིགས་ཀྱི་བུ་བཟང་པོ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །བཟང་པོ་ཁྱོད་དེ་བཞིན་གཤེགས་པའི་ཆོས་ཉིད་རྗེས་སུ་ཐོབ་བམ།
en: Then Venerable Ānanda asked Bhadra the son of noble family, “Bhadra, have you already attained the true nature of a tathāgata?

source: ཅི་ན་ཁྱོད་ཇི་ལྟར་དེ་བཞིན་གཤེགས་པ་དེ་བཞིན་ཉིད་གསུང་བ་ལྟར་ཁྱོད་དེ་སྐད་སྨྲ།
en: How else would you speak of suchness as the Tathāgata does?”

source: བཟང་པོས་སྨྲས་པ། ཀུན་དགའ་བོ་ཆོས་ཐམས་ཅད་ཀྱང་དེ་བཞིན་གཤེགས་པའི་ཆོས་ཉིད་ཐོབ་པ་ཡིན་ནོ། །
en: “Ānanda,” Bhadra replied, “all phenomena have attained the true nature of the Tathāgata.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Why?

source: ཀུན་དགའ་བོ་འདི་ལྟར་དེ་བཞིན་གཤེགས་པས་དེ་བཞིན་ཉིད་དབྱེར་མེད་པ་ཉིད་དུ་ཐུགས་སུ་ཆུད་དེ།
en: Because, Ānanda, the Tathāgata has realized suchness as indivisibility.

source: དེ་བཞིན་ཉིད་དབྱེར་མེད་པ་གང་ཡིན་པ་དེར་ཁོ་བོ་ཡང་ཆུད་ཅིང་ཇི་ལྟར་ཁོ་བོ་ཆུད་པ་དེ་བཞིན་དུ་སེམས་ཅན་ཐམས་ཅད་ཀྱང་ཆུད་ལ། ཇི་ལྟར་སེམས་ཅན་ཐམས་ཅད་ཆུད་པ་དེ་བཞིན་དུ་ཆོས་ཐམས་ཅད་ཀྱང་ཆུད་པའི་ཕྱིར་ཏེ།
en: I, too, am included in that which is indivisible with suchness, and just as I am included, so, too, are all beings included, and just as all beings are included, so, too, are all phenomena included.

source: བཙུན་པ་ཀུན་དགའ་བོ་དེ་བཞིན་གཤེགས་པའི་ཆོས་ཉིད་ནི་གཉིས་ཀྱིས་རབ་ཏུ་ཕྱེ་བ་མ་ཡིན་ནོ། །
en: Thus, honorable Ānanda, the true nature of the Tathāgata is not something that can be divided in two.

source: བཙུན་པ་ཀུན་དགའ་བོ་གཉིས་སུ་མེད་པ་ནི་གང་ན་ཀུན་ཏུ་ཤེས་པ་མེད་པ་ཉིད་དང་། ཡོངས་སུ་ཤེས་པ་མེད་པ་ཉིད་དོ། །
en: “Honorable Ānanda, nonduality is itself not something to be cognized or comprehended.

source: འདུ་ཤེས་ཡོངས་སུ་ཤེས་པའི་ཤེས་པ་ནི་སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་ཡིན་པའི་ཕྱིར་རོ། །
en: Because the knowledge of knowing notions is the wisdom of a buddha.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་རིགས་ཀྱི་བུ་བཟང་པོ་ནི་ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་མགོ་རྨོངས་པར་བགྱིད་པ་སྟེ།
en: Then Venerable Ānanda said to the Blessed One, “Blessed One, Bhadra the son of noble family bewilders the entire world with its gods.

source: སྔོན་ཡང་སྒྱུ་མའི་ཆོས་ཉིད་ཀྱིས་མགོ་རྨོངས་པར་བགྱིས་སོ། །ད་ཡང་ཤེས་རབ་དང་། ཡེ་ཤེས་ཀྱིས་མགོ་རྨོངས་པར་བགྱིད་དོ། །
en: While previously he bewildered it with the nature of illusions, now he bewilders it with insight and wisdom.

source: དེ་ཅིའི་སླད་དུ་ཞེ་ན།
en: Why is this so?

source: འདིའི་ཤེས་རབ་དང་། ཡེ་ཤེས་ཀྱི་སྤོབས་པ་ནི་དེ་ལྟ་བུ་ལགས་པའི་སླད་དུའོ། །
en: Because his inspired speech on insight and wisdom is like this.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་སྒྱུ་མ་མཁན་བཟང་པོ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །བཟང་པོ་ཁྱོད་ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་མགོ་རྨོངས་པར་བྱེད་པ་བདེན་ནམ། གསོལ་པ།
en: Then the Blessed One asked Bhadra the illusionist, “Bhadra, is it true that you bewilder this entire world with its gods?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཇི་ལྟར་མགོ་རྨོངས་པར་མཛད་པ་དེ་བཞིན་དུ་བདག་ཀྱང་མགོ་རྨོངས་པར་བགྱིད་ལགས་སོ། །
en: “Indeed, just as the Blessed One bewilders, so do I bewilder.

source: བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ། བདག་མེད་པ་ཉིད་ཀྱིས་སེམས་ཅན་དུ་ཐ་སྙད་བཏགས་ཏེ་ཆོས་སྟོན་པ་དང་།
en: Although there is no self, the Blessed One teaches the Dharma using the conventional term beings.

source: སྲོག་མེད་པ་དང་།
en: Although there are no living beings or persons, he teaches the Dharma using the term person.

source: གང་ཟག་མེད་པ་ཉིད་ཀྱིས་གང་ཟག་ཏུ་ཆོས་སྟོན་པ་འདི་ནི་མགོ་རྨོངས་པར་བགྱིད་པ་ཆེན་པོ་ལགས་པའི་སླད་དུའོ། །
en: Therefore, he is a great bewilderer.

source: དེ་བཞིན་གཤེགས་པས་ནི་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་བཞུགས་ནས་ཆོས་འགའ་ཡང་འཆི་འཕོ་བ་འམ། འགྲོ་བའམ། སྐྱེ་བ་མ་གཟིགས་མོད་ཀྱི། འཆི་འཕོ་བ་དང་།
en: The Tathāgata rests at the seat of awakening, seeing no phenomenon whatsoever—no transference at death, no transmigration, and no birth—yet he teaches the Dharma of transference at death, transmigration, and birth.

source: འགྲོ་བ་དང་། སྐྱེ་བའི་ཆོས་སྟོན་པར་ཡང་མཛད་དེ། བཅོམ་ལྡན་འདས་དེ་ལྟ་ལགས་པས་དེ་བཞིན་གཤེགས་པ་ཡང་དག་པར་གསུང་བ་བཀའ་སྩོལ་བ་ལྟར་ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་གྱི་ཡུལ་ག་ལ་ལགས།
en: In this way, the Blessed One appears in any place, for the world with its gods, as the Tathāgata proclaiming the truth.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་སྒྱུ་མ་མཁན་བཟང་པོ་ལ་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ཏེ། རིགས་ཀྱི་བུ་ལེགས་སོ་ལེགས་སོ། །
en: Then the Blessed One gave his approval to Bhadra the illusionist, saying, “Well done, son of noble family, well done, well done!

source: ཁྱོད་ཇི་སྐད་སྨྲ་བ་དེ་ཁོ་ན་བཞིན་ཏེ།
en: It is just as you have said.

source: འདི་ལྟ་སྟེ་བདག་མེད་པ་ཉིད་ཀྱིས་སེམས་ཅན་དུ་ཐ་སྙད་བཏགས་ཏེ་ཆོས་སྟོན་པ་དང་།
en: Although there is no self, I teach the Dharma using the conventional term beings.

source: གང་ཟག་མེད་པ་ཉིད་ཀྱིས་གང་ཟག་ཏུ་ཆོས་སྟོན་པ་འདི་ནི་མགོ་རྨོངས་པ་ཆེན་པོ་ཡིན་ནོ། །
en: Therefore, this is a great bewilderment.

source: དེ་བཞིན་གཤེགས་པས་ནི་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་བཞུགས་ནས་ཆོས་འགའ་ཡང་འཆི་འཕོ་བ་འམ། འགྲོ་བ་འམ། སྐྱེ་བ་མ་གཟིགས་མོད་ཀྱི། འཆི་འཕོ་བ་དང་། འགྲོ་བ་དང་།
en: The Tathāgata rests at the seat of awakening, seeing no phenomenon whatsoever—no transference at death, no transmigration, and no birth—yet he teaches the Dharma of transference at death, transmigration, and birth.

source: སྐྱེ་བའི་ཆོས་སྟོན་པར་ཡང་མཛད་དེ། འདི་ལ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་འམ། ཡོངས་སུ་མྱ་ངན་ལས་བཟླ་བའི་ཕྱིར་ཆོས་སྟོན་པའི་ཆོས་ནི་འགའ་ཡང་མེད་དོ། །
en: In this sense, there is no such thing as final nirvāṇa, nor is there any Dharma taught in order to attain final nirvāṇa.”

source: དེ་ནས་རིགས་ཀྱི་བུ་བཟང་པོས་བཅོམ་ལྡན་འདས་ལ་རབ་ཏུ་འབྱུང་བར་གསོལ་པ་དང་།
en: Then Bhadra the son of noble family requested the Blessed One that he might go forth.

source: བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པ་ལ་བཀའ་སྩལ་པ། བྱམས་པ་ཁྱོད་ཀྱིས་རིགས་ཀྱི་བུ་བཟང་པོ་རབ་ཏུ་ཕྱུང་ཤིག །
en: The Blessed One instructed the bodhisattva Maitreya, “Maitreya, send forth Bhadra the son of noble family.”

source: དེ་ནས་བྱམས་པས་རིགས་ཀྱི་བུ་བཟང་པོ་རབ་ཏུ་ཕྱུང་རྫོགས་པར་བསྙེན་པར་བྱས་སོ། །རབ་ཏུ་རྫོགས་པར་བསྙེན་ནས་ཀྱང་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་ཁ་དོག་དང་། རྟགས་དང་། ཚུལ་གྱིས་རབ་ཏུ་བྱུང་བ་མ་ལགས་སོ། །
en: Then Maitreya sent forth and fully ordained Bhadra the son of noble family, and when he had completed the ordination, he said to the Blessed One, “Blessed One, bodhisattvas do not go forth by means of outward appearances, signs, and procedures.

source: བཅོམ་ལྡན་འདས་དེ་ཅིའི་སླད་དུ་ཞེ་ན།
en: Why, Blessed One?

source: བྱང་ཆུབ་སེམས་དཔའ་གང་ཞིག་མཚན་མ་ཐམས་ཅད་ལ་ཡང་ཆགས་པ་མ་མཆིས་ལ་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བགྱི་བའི་སླད་དུ་ཁམས་གསུམ་ན་ཡང་གནས་ན་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་རབ་ཏུ་བྱུང་བ་ལགས་སོ། །
en: Because bodhisattvas are not attached to any of these outer attributes, yet they remain in the three realms in order to mature beings. This is the going forth of bodhisattvas.”

source: ཡང་དེའི་ཚེ་བསྟན་པ་འདི་བཤད་པ་ན་སྲོག་ཆགས་ལྔ་སྟོང་གིས་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ། །
en: And at that time, when this teaching had been explained, five thousand beings generated the mind intent on complete and perfect awakening.

source: དགེ་སློང་ཉིས་བརྒྱ་ནི་ལེན་པ་མེད་པར་ཟག་པ་རྣམས་ལས་སེམས་རྣམ་པར་གྲོལ་ལོ། །
en: The minds of two hundred monks were freed from defilements without further appropriation.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཆོས་ཀྱི་རྣམ་གྲངས་འདིའི་མིང་ཅི་ལགས།
en: Then Venerable Ānanda asked the Blessed One, “Blessed One, what is the name of this Dharma discourse?

source: འདིའི་མིང་ཇི་སྐད་གཟུང་བར་བགྱི།
en: By what name should it be remembered?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། སྒྱུ་མ་མཁན་བཟང་པོ་ལུང་བསྟན་པ་ཞེས་བྱ་བར་ཟུང་ཤིག །རིམ་གྱིས་བྱང་ཆུབ་ཡང་དག་པར་འབྱུང་བ་ཞེས་བྱ་བར་ཡང་ཟུང་ཤིག །
en: The Blessed One said, “Remember it as The Prophecy for Bhadra the Illusionist, or remember it as The Complete Emergence of Awakening in Stages.

source: ཀུན་དགའ་བོ་བྱང་ཆུབ་སེམས་དཔའ་གང་དེ་བཞིན་གཤེགས་པས་ལྟ་བར་འདོད་པ་དང་། སེམས་ཅན་རྣམས་ལ་སངས་རྒྱས་ཀྱི་མཛད་པ་བྱ་བར་འདོད་པ་དེས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་གཟུང་བར་བྱ།
en: “Ānanda, bodhisattvas who wish to look upon the Tathāgata and enact buddha activity for the sake of beings should remember this Dharma discourse.

source: བཅང་བར་བྱ། བཀླག་པར་བྱ། གཞན་དག་ལ་ཡང་བསྟན་པར་བྱའོ། །
en: They should bear it in mind, recite it aloud, and teach it to others.

source: ཀུན་དགའ་བོ་གང་གིས་འདི་བཟུང་བ་དང་། བཅངས་པ་དང་། བཀླགས་པ་དང་། གཞན་དག་ལ་ཡང་རབ་ཏུ་བསྟན་པ་དེས་ནི་དེ་བཞིན་གཤེགས་པ་མཐོང་བ་ཡིན། དེས་ནི་སེམས་ཅན་རྣམས་ལ་སངས་རྒྱས་ཀྱི་མཛད་པ་ཡང་བྱས་པ་ཡིན་ནོ། །
en: Because, Ānanda, those who remember it, bear it in mind, recite it aloud, and teach it to others will see the Tathāgata, and thus will they enact buddha activity for the sake of beings.

source: ཀུན་དགའ་བོ་དེ་ལྟ་བས་ན་ཁྱོད་ཀྱི་སྐྱེ་བོ་མང་པོ་ལ་བདེ་བ་དང་། འཇིག་རྟེན་ལ་སྙིང་བརྩེ་བ་དང་། འདི་ལྟ་སྟེ། ལྷ་དང་མི་རྣམས་ཀྱི་དོན་དང་། ཕན་པ་དང་བདེ་བའི་ཕྱིར་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཟུང་ཤིག །
en: “Therefore, Ānanda, for the happiness of many beings, out of heartfelt love for the world, and for the welfare, benefit, and happiness of gods and humans, remember this Dharma discourse!

source: ཆོངས་ཤིག །ལྷོགས་ཤིག །ཀུན་ཆུབ་པར་གྱིས་ཤིག །
en: Bear it in mind, recite it, and master it perfectly.

source: ཀུན་དགའ་བོ་ཆོས་གང་དག་གིས་བྱང་ཆུབ་ཡང་དག་པར་འབྱུང་བ་དང་། ཐེག་པ་ཆེན་པོ་འདི་ལ་ཡང་ཡང་དག་པར་འབྱུང་བར་འགྱུར་བ་དེ་དག་ནི་ཐེག་པ་ཆེན་པོ་འདི་ལས་ཡང་དག་པར་རབ་ཏུ་སྟོན་ཏོ། །
en: “Ānanda, the Dharma through which awakening completely emerges is that of the Mahāyāna, and it is from the Mahāyāna that this Dharma is taught.

source: དེས་ན་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བྱང་ཆུབ་ཡང་དག་པར་འབྱུང་བ་ཞེས།
en: Therefore, this Dharma discourse is called The Complete Emergence of Awakening.

source: ཀུན་དགའ་བོ་ཁྱོད་མོས་པར་བྱའོ། །
en: “Ānanda, you should take interest in this.

source: ཁོད་དུ་ཆུད་པར་བྱའོ། །
en: You should understand it.

source: གང་ཞིག་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་གླེགས་བམ་དུ་བྱེད་པ་འམ། ལུས་ལ་སྲེལ་བ་དེའི་ལུས་ལ་དེ་བཞིན་གཤེགས་པ་ཡོད་པ་ཡིན་ན་གང་དག་གིས་ཐོས་ནས་དེ་བཞིན་ཉིད་དུ་སྒྲུབ་པ་ལྟ་སྨོས་ཀྱང་ཅི་དགོས།
en: The Tathāgata will be in the bodies of those who compile this Dharma discourse into a book and keep it on their bodies, not to mention those who have learned it and then established themselves in suchness.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་རིགས་ཀྱི་བུ་བཟང་པོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ནི་སྔོན་གྱི་དགེ་བའི་རྩ་བ་སྐུལ་བ་ཞེས་བགྱི་ལགས་སོ། །
en: Then Bhadra the son of noble family said to the Blessed One, “The Blessed One’s Dharma discourse should also be called Instigating the Roots of Previous Virtue.

source: བཅོམ་ལྡན་འདས་འདི་ལྟར་བདག་གིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཐོས་ནས་དགེ་བའི་རྩ་བ་སྔོན་བསགས་པ་ཐམས་ཅད་མངོན་སུམ་དུ་གྱུར་པའི་སླད་དུ་ལགས་སོ། །བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས། རིགས་ཀྱི་བུ་བཟང་པོ་དང་། ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་དང་། ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེ་དང་།
en: Because, Blessed One, after hearing this Dharma discourse, all the roots of virtue that I had accumulated previously have become manifest.”

source: ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དང་། དྲི་ཟར་བཅས་པའི་འཇིག་རྟེན་ཡི་རངས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དོ།། །།
en: After the Blessed One had given this teaching, Bhadra the son of noble family, Venerable Ānanda, that whole assembly, and the world with its gods, humans, asuras, and gandharvas praised the words of the Blessed One.
